export const FilterCakesData = [
  {
    name: "Категории",
    options: ["Праздничные", "Свадебные", "Обычные"],
  },
  {
    name: "Основа",
    options: ["Песочная", "Бисквитная"],
  },
  {
    name: "Форма",
    options: ["Круглая", "Квадратная"],
  },
  {
    name: "Крем",
    options: [
      "Шоколадный",
      "Ягодный",
      "Фруктовый",
      "Ореховый",
      "Сливочный",
      "Карамельный",
    ],
  },
];

export const FilterCupcakesData = [
  {
    name: "Категории",
    options: ["Праздничные", "Обычные"],
  },
  {
    name: "Основа",
    options: ["Песочная", "Бисквитная"],
  },
  {
    name: "Крем",
    options: [
      "Шоколадный",
      "Ягодный",
      "Фруктовый",
      "Ореховый",
      "Сливочный",
      "Карамельный",
    ],
  },
];

export const FilterPiesData = [
  {
    name: "Категории",
    options: ["Праздничные", "Свадебные", "Обычные"],
  },
  {
    name: "Основа",
    options: ["Песочная", "Слоёная", "Заварная", "Бисквитная"],
  },
  {
    name: "Форма",
    options: ["Круглая", "Квадратная", "Прямоугольная", "Овальная"],
  },
];

export const FilterPopularData = [
  {
    name: "Тип десерта",
    options: ["Торт", "Капкейк", "Пирожное"],
  },
];

export const FilterLocalStorage = {
  price: {
    cakes: {
      min: "",
      max: "",
    },
    cupcakes: {
      min: "",
      max: "",
    },
    pies: {
      min: "",
      max: "",
    },
    popular: {
      min: "",
      max: "",
    },
  },
  cakes: {
    Категории: {
      Праздничные: false,
      Свадебные: false,
      Обычные: false,
    },
    Основа: {
      Песочная: false,
      Бисквитная: false,
    },
    Форма: {
      Круглая: false,
      Квадратная: false,
    },
    Крем: {
      Шоколадный: false,
      Ягодный: false,
      Фруктовый: false,
      Ореховый: false,
      Сливочный: false,
      Карамельный: false,
    },
  },
  cupcakes: {
    Категории: {
      Праздничные: false,
      Обычные: false,
    },
    Основа: {
      Песочная: false,
      Бисквитная: false,
    },
    Крем: {
      Шоколадный: false,
      Ягодный: false,
      Фруктовый: false,
      Ореховый: false,
      Сливочный: false,
      Карамельный: false,
    },
  },
  pies: {
    Категории: {
      Праздничные: false,
      Свадебные: false,
      Обычные: false,
    },
    Основа: {
      Песочная: false,
      Бисквитная: false,
      Слоёная: false,
      Заварная: false,
    },
    Форма: {
      Круглая: false,
      Квадратная: false,
      Овальная: false,
      Прямоугольная: false,
    },
  },
  popular: {
    "Тип десерта": {
      Торт: false,
      Капкейк: false,
      Пирожное: false,
    },
  },
};
